tap "hashicorp/tap"
tap "FelixKratz/formulae" # Sketchybar dependency
tap "oven-sh/bun"

cask "macfuse"
cask "nikitabobko/tap/aerospace"
cask "font-hack-nerd-font"
cask "font-bigblue-terminal-nerd-font"
cask "1password-cli"
cask "raycast"
cask "ghostty"
cask "shortcat"
cask "postman"

brew "git"
brew "zsh"
brew "awscli"
brew "neovim"
brew "fzf"
brew "zoxide"
brew "bat"
brew "jesseduffield/lazygit/lazygit"
brew "btop"
brew "stow"
brew "gh"
brew "ansible"
brew "sketchybar"
brew "borders"
brew "tmux"
brew "ripgrep"
brew "tree"
brew "node"
brew "starship"
brew "thefuck"
brew "vivid"
brew "speedtest-cli"
brew "mas"
brew "terminalgpt"
brew "jq"
brew "yq"
brew "hashicorp/tap/terraform"
brew "kubectl"
brew "kanata"
brew "imagemagick"
brew "oven-sh/bun/bun"
brew "cyberduck"
brew "coreutils"
brew "docker"
brew "eza"
brew "lazydocker"
brew "neovim"
brew "obsidian"
brew "qmk"
brew "raycast"
brew "ripgrep"
brew "python@3.13"
brew "tree-sitter"
brew "zellij"
brew "minikube"
brew "superfile"
brew "htop"

mas "Things", id: 904280696
mas "Drafts", id: 1435957248
mas "Tiny Ipsum", id: 1445179392
mas "Timery", id: 1425368544
mas "LittleIpsum", id: 405772121
mas "WebSSH", id: 497714887
mas "Fantastical", id: 975937182
mas "Dark Noise", id: 1465439395
mas "Front and Center", id: 1493996622
mas "Parcel", id: 639968404
mas "Spark Desktop", id: 6445813049